Revit 2026 API

# FabricationConfigurationInfo Class

---

Represents an MEP object that holds the properties of an MEP fabrication configuration.

SystemObject Autodesk.Revit.DBFabricationConfigurationInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationConfigurationInfo : IDisposable
```
```vb
Public Class FabricationConfigurationInfo
	Implements IDisposable
```
```cpp
public ref class FabricationConfigurationInfo : IDisposable
```
```fsharp
type FabricationConfigurationInfo =
    class
        interface IDisposable
    end
```

The FabricationConfigurationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CloudId | The identifier of the cloud configuration. |
|  | Description | The description of the fabrication configuration. |
|  | GUID | The unique identification of the fabrication configuration. |
|  | IsCloudConfiguration | Whether the cloud configuration is a remote cloud one. |
|  | IsLocked | Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the fabrication configuration. |
|  | Path | The path where the fabrication configuration is located. To populate this property, you may need to call FindSourceFabricationConfiguration first. |
|  | UnitSystem | The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial. |
|  | Version | The version of the fabrication configuration. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationConfigurationInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | FindSourceFabricationConfiguration | Finds the source fabrication configuration on disk which matches the input fabrication configuration. |
|  | GetAllFabricationConfigurations | Gets all added fabrication configurations. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetProfiles | Return the profiles in the fabrication configuration. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Checks if the fabrication configuration is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

To populate the Path property, you may need to call FindSourceFabricationConfiguration first.

#### Reference

Autodesk.Revit.DB Namespace